In [2]:
import pandas as pd
from math import radians, sin, cos, sqrt, atan2

# Define a function to calculate Haversine distance (same as before)
def haversine_distance(lat1, lon1, lat2, lon2):
    # Convert latitude and longitude from degrees to radians
    lat1, lon1, lat2, lon2 = map(radians, [lat1, lon1, lat2, lon2])

    # Haversine formula (same as before)
    d_lat = lat2 - lat1
    d_lon = lon2 - lon1
    a = sin(d_lat/2)**2 + cos(lat1) * cos(lat2) * sin(d_lon/2)**2
    c = 2 * atan2(sqrt(a), sqrt(1-a))
    earth_radius_km = 6371.0  # Earth's radius in kilometers
    distance_km = earth_radius_km * c

    return distance_km

In [8]:
import pandas as pd
import numpy as np

# Provided data for 'Column1' and 'Column2'
data_column1_column2 = [
    [6.75, 86.],
    [6.75, 86.],
    [6.75, 86.],
    [13., 80.],
    [12.75, 79.75],
    [12.75, 79.5]
]

# Generate sample data for 'Column3' and 'Column4'
# Assuming you want random values in a similar range
data_column3_column4 = np.random.uniform(low=-2.5, high=2.5, size=(len(data_column1_column2), 2))

# Combine all columns into one array
combined_data = np.hstack((data_column1_column2, data_column3_column4))

# Create a DataFrame
df = pd.DataFrame(combined_data, columns=['Column1', 'Column2', 'Column3', 'Column4'])

# Print the DataFrame
print(df)

   Column1  Column2   Column3   Column4
0     6.75    86.00 -1.284750  1.814764
1     6.75    86.00 -1.087757  1.880140
2     6.75    86.00  0.558888 -1.349162
3    13.00    80.00  1.377463 -0.712245
4    12.75    79.75  1.433434 -2.421520
5    12.75    79.50 -0.074845  2.295551

     International airline passengers: monthly totals in thousands. Jan 49 ? Dec 60
0                                                  112
1                                                  118
2                                                  132
3                                                  129
4                                                  121
..                                                 ...
139                                                606
140                                                508
141                                                461
142                                                390
143                                                432

[144 rows x 1 columns]

In [4]:
df.describe()

       International airline passengers: monthly totals in thousands. Jan 49 ? Dec 60
count                                         144.000000
mean                                          280.298611
std                                           119.966317
min                                           104.000000
25%                                           180.000000
50%                                           265.500000
75%                                           360.500000
max                                           622.000000

In [5]:
values=df.values.astype('float32')
values.shape

(144, 1)